backend/controllers/PostController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
UPDATE `post` SET `content`='<p style=\"text-align: center;\"><img src=\"http://localhost:9999/upload/image/20180425/152464553168270874.jpg\" title=\"152464553168270874.jpg\" alt=\"0b7b02087bf40ad1200912d8552c11dfa9ecce18.jpg\"/></p><p style=\"text-align: center;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<video class=\"edui-upload-video  vjs-default-skin  video-js\" controls=\"\" preload=\"none\" width=\"420\" height=\"280\" src=\"http://localhost:9999/upload/video/20180425/152464559393319702.mp4\" data-setup=\"{}\"><source src=\"http://localhost:9999/upload/video/20180425/152464559393319702.mp4\" type=\"video/mp4\"/></video></p>', `tags`='ÁØÆÁêÉ,‰ΩìËÇ≤', `status`=2, `update_time`=1524646438, `author_id`=1, `cat_id`=3 WHERE `id`=48

    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {
---
SELECT * FROM `post` WHERE `id`='48'