frontend/controllers/PostController.php

        			'only'=>['detail'],
        			'lastModified'=>function ($action,$params){
        				$q = new Query();
        				return $q->from('post')->max('update_time');
---
SELECT MAX(update_time) FROM `post`

    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {
---
SELECT * FROM `post` WHERE `id`='42'

    public function actionDetail($id)
    {
    	//step1. 准备数据模型
    	$model = $this->findModel($id);
    	$tags=Tag::findTagWeights();
    	$recentComments=Comment::findRecentComments();

    	$userMe = User::findOne(Yii::$app->user->id);
    	$commentModel = new Comment();
    	$commentModel->email = $userMe->email;
    	$commentModel->userid = $userMe->id;

    	//step2. 当评论提交时，处理评论
    	if($commentModel->load(Yii::$app->request->post()))
    	{
    		$commentModel->status = 1; //新评论默认状态为 pending
    		$commentModel->post_id = $id;
    		if($commentModel->save())
---
SELECT EXISTS(SELECT * FROM `user` WHERE `id`=6)
SELECT * FROM `user` WHERE `id`=6
SELECT EXISTS(SELECT * FROM `post` WHERE `id`='41')
INSERT INTO `comment` (`email`, `userid`, `content`, `status`, `post_id`, `create_time`) VALUES ('chaolong112@qq.com', 6, '？？？？', 1, 41, 1497178908)