backend/views/post/_form.php

SELECT `name`, `id` FROM `news_category` ORDER BY `id`
SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
SELECT `nickname`, `id` FROM `Adminuser`
---
	*/
	?>

    <?= $form->field($model,'cat_id')
    ->dropDownList(\common\models\NewsCategory::find()
        ->select(['name','id'])
        ->orderBy('id')
        ->indexBy('id')
        ->column(),
        ['prompt'=>'请选择分类']);?>

    <?= $form->field($model,'status')
     ->dropDownList(Poststatus::find()
                    ->select(['name','id'])
                    ->orderBy('position')
                    ->indexBy('id')
                    ->column(),
           ['prompt'=>'请选择状态']);?>



    <?= $form->field($model,'author_id')
     ->dropDownList(Adminuser::find()
                    ->select(['nickname','id'])
                    ->indexBy('id')
                    ->column(),
           ['prompt'=>'请选择作者']);?>