backend/views/post/index.php


   <?php //$searchModel = new common\models\Tag();?>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
           // ['class' => 'yii\grid\SerialColumn'],

            //'id',
            ['attribute'=>'id',
            'contentOptions'=>['width'=>'30px'],
            ],
            'title',
        	//'author_id',
        	['attribute'=>'authorName',
        	'label'=>'作者',
        	'value'=>'author.nickname',
    		],
           // 'content:ntext',
            'tags:ntext',
            //'status',
            ['attribute'=>'status',
            'value'=>'status0.name',
            'filter'=>Poststatus::find()
            		->select(['name','id'])
            		->orderBy('position')
            		->indexBy('id')
            		->column(),
   			 ],
---
SELECT * FROM `poststatus` WHERE `id`=2
SELECT `name`, `id` FROM `poststatus` ORDER BY `position`