common/models/Adminuser.php

    public static function findIdentity($id)
    {
    	return static::findOne(['id' => $id]);
---
SELECT * FROM `Adminuser` WHERE `id`=11

    public static function findByUsername($username)
    {
    	return static::findOne(['username' => $username]);
---
SELECT * FROM `Adminuser` WHERE `username`='test'