common/models/Comment.php

SELECT * FROM `comment` WHERE `status`=2 ORDER BY `create_time` DESC LIMIT 10
---
    public static function findRecentComments($limit=10)
    {
    	return Comment::find()->where(['status'=>2])->orderBy('create_time DESC')
    	->limit($limit)->all();

SELECT COUNT(*) FROM `comment` WHERE create_time>=1509494400 AND create_time<1512086400
---
    public function getCommentCountByCreateTime($time)
    {
        $startTime = strtotime($time.'-01');
        $time = str_replace('-', '', $time);
        $nexMonth = $this->getMonth($time, 0);
        $lastTime  = strtotime($nexMonth.'-01');

        return static::find()
            ->where('create_time>=:start AND create_time<:last', [':start' => $startTime, ':last' => $lastTime])
            ->count();