common/models/PostCollection.php

INSERT INTO `post_collection` (`uniquekey`, `title`, `category`, `date`, `author_name`, `url`, `thumbnail_pic_s`) VALUES ('b31d301c2afd00d73731f658e417d3b7', 'Â∞èÁ±≥‰∏äÂ∏ÇÔºöÈõ∑ÂÜõÂíåÊûóÊñå‰∫´ÂèóÂà∞ÁöÑÔºåÊÅ∞ÊòØ‰∫îÂπ¥ÂâçÈ©¨‰∫ë‚ÄúÊ±ÇËÄå‰∏çÂæó‚ÄùÁöÑÔºÅ', 'Á§æ‰ºö', '2018-05-04 10:26', '‰∏úÈó®VÂêπÈõ™', 'http://mini.eastday.com/mobile/180504102634417.html', 'http://03.imgmini.eastday.com/mobile/20180504/20180504_93dc0505a6b4cac3c8d9c0fe27e7fcc0_cover_mwpm_03200403.jpg')
---
    public static function collectionData($data)
    {
        if (is_array($data)) {
            foreach ($data as $v) {
                if (empty(PostCollection::isCollection($v['url']))) {
                    $model = new PostCollection();
                    $model->uniquekey = $v['uniquekey'];
                    $model->title = $v['title'];
                    $model->category = $v['category'];
                    $model->date = $v['date'];
                    $model->author_name = $v['author_name'];
                    $model->url = $v['url'];
                    $model->thumbnail_pic_s = $v['thumbnail_pic_s'];
                    $model->save();

SELECT `url`, `status` FROM `post_collection` WHERE url='http://mini.eastday.com/mobile/180504102634417.html'
---
    public static function isCollection($url)
    {
        return (new Query())
            ->select(['url', 'status'])
            ->from('post_collection')
            ->where('url=:url', [':url' => $url])
            ->all();

SELECT * FROM `post_collection` WHERE status=0 LIMIT 1
---
    public function changeStatus($url)
    {
        if (!empty($url)) {
            $model = static::find()->where('url=:url', [':url' => $url])->one();