common/models/Post.php

    public function getCommentCount()
    {
    	return Comment::find()->where(['post_id'=>$this->id,'status'=>2])->count();
---
SELECT COUNT(*) FROM `comment` WHERE (`post_id`=90) AND (`status`=2)

    public function getPostCountByCreateTime($time)
    {
        $startTime = strtotime($time.'-01');
        $time = str_replace('-', '', $time);
        $nexMonth = $this->getMonth($time, 0);
        $lastTime  = strtotime($nexMonth.'-01');

        return static::find()
            ->where('create_time>=:create_time AND create_time<:lastTime', [':create_time' => $startTime, ':lastTime' => $lastTime])
            ->count();
---
SELECT COUNT(*) FROM `post` WHERE (1) AND (update_time>=1509494400 AND update_time<1512086400)

    public function getPostCountByUpdateTime($time)
    {
        $startTime = strtotime($time.'-01');
        $time = str_replace('-', '', $time);
        $nexMonth = $this->getMonth($time, 0);
        $lastTime  = strtotime($nexMonth.'-01');

        return static::find()
            ->where('update_time' != 'create_time')
            ->andWhere('update_time>=:start AND update_time<:last', [':start' => $startTime, ':last' => $lastTime])
            ->count();
---
SELECT COUNT(*) FROM `post` WHERE (1) AND (update_time>=1509465600 AND update_time<1512057600)

    public function getMostViewPost()
    {
        $result = array();
        $viewPost =  (new Query())->select(['id', 'view', 'create_time'])
            ->from('post')
            ->orderBy(['view' => SORT_DESC, 'create_time' => SORT_DESC])
            ->limit(10)
            ->all();
---
SELECT `id`, `view`, `create_time` FROM `post` ORDER BY `view` DESC, `create_time` DESC LIMIT 10

    public static function getTagPostNumber($tag)
    {
        return static::find()->andFilterWhere(['like', 'tags', $tag])->count();
---
SELECT COUNT(*) FROM `post` WHERE `tags` LIKE '%Yii2%'