common/models/Tag.php

SELECT * FROM `tag` WHERE `name`='ÁØÆÁêÉ'
SELECT COUNT(*) FROM `tag` WHERE `name`='ÁØÆÁêÉ'
INSERT INTO `tag` (`name`, `frequency`) VALUES ('ÁØÆÁêÉ', 1)
UPDATE `tag` SET `frequency`=2 WHERE `id`=75
---
    public static function addTags($tags)
    {
    	if(empty($tags)) return ;

    	foreach ($tags as $name)
    	{
    		$aTag = Tag::find()->where(['name'=>$name])->one();
    		$aTagCount = Tag::find()->where(['name'=>$name])->count();

    		if(!$aTagCount)
    		{
    			$tag = new Tag;
    			$tag->name = $name;
    			$tag->frequency = 1;
    			$tag->save();
    		}
    		else
    		{
    			$aTag->frequency += 1;
    			$aTag->save();

SELECT * FROM `tag` WHERE `name`='ÁØÆÁêÉÔºå‰ΩìËÇ≤'
SELECT COUNT(*) FROM `tag` WHERE `name`='ÁØÆÁêÉÔºå‰ΩìËÇ≤'
DELETE FROM `tag` WHERE `id`=76
---
    public static function removeTags($tags)
    {
    	if(empty($tags)) return ;

    	foreach($tags as $name)
    	{
    		$aTag = Tag::find()->where(['name'=>$name])->one();
    		$aTagCount = Tag::find()->where(['name'=>$name])->count();

    		if($aTagCount)
    		{
    			if($aTagCount && $aTag->frequency<=1)
    			{
    				$aTag->delete();

SELECT * FROM `tag` ORDER BY `frequency` DESC LIMIT 20
SELECT COUNT(*) FROM `tag`
---
    public static function findTagWeights($limit=20)
    {
    	$tag_size_level = 5;

    	$models=Tag::find()->orderBy('frequency desc')->limit($limit)->all();
    	$total=Tag::find()->limit($limit)->count();

SELECT * FROM `tag` ORDER BY `frequency` DESC LIMIT 10
SELECT COUNT(*) FROM `post`
---
    public function getTagPostData($limit=10)
    {
        /**@var $tags Tag**/
        $tags = Tag::find()->orderBy('frequency desc')->limit($limit)->all();
        $postCount = Post::find()->count();