frontend/views/layouts/main.php

SELECT COUNT(*) FROM `post`
---
    //文章搜索框
    $searchForm = '<li>
					  <form class="form-inline" action="' .  Yii::$app->urlManager->createUrl(['post/index']) .'" id="w0" method="get">
						  查找文章('. \common\models\Post::find()->count() . ')