frontend/views/post/index.php

				  echo $data;
				  */
				  ?>
				  <?= Post::find()->count();?>
---
SELECT COUNT(*) FROM `post`